app/controllers/registrations_controller.rb

INSERT INTO "users" ("name", "last_name", "email", "phone", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
	    #complete this method
	    @user = User.new(params.require(:registrations).permit(:name, :last_name, :email, :password, :phone))

	    if @user.save