app/controllers/sessions_controller.rb

	def create
		#complete this method
		contador = 0
		for user in User.all
			if user[:email] == params[:session][:email].downcase
				contador = 1
			end
		end

		if contador == 0
		  flash[:danger] = 'Invalid email/password'
	      render 'new'
	    else


	    	user = User.find_by(email: params[:session][:email].downcase)
---
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "jrvalenzuela@miuandes.cl"], ["LIMIT", 1]]