app/controllers/users_controller.rb

  def update
    #complete this
    @user = User.find(params[:id])

    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "holahola"], ["updated_at", "2019-04-19 17:12:39.394466"], ["id", 4]]

  def destroy
    #complete this method
    @user = User.find(params[:id])
    if @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]